Erstellt einen Pandas DataFrame mit den folgenden Daten. Nennt ihn buch_verkaeufe.

In [2]:
import pandas as pd

In [4]:
data = {
    'Buchtitel': [
        'Der Ruf des Kuckucks',
        'Harry Potter und der Stein der Weisen',
        'Eine kurze Geschichte der Zeit',
        'Stolz und Vorurteil',
        'Die Mitternachtsbibliothek'
    ],
    'Autor': [
        'Robert Galbraith',
        'J.K. Rowling',
        'Stephen Hawking',
        'Jane Austen',
        'Matt Haig'
    ],
    'Genre': [
        'Krimi',
        'Fantasy',
        'Wissenschaft',
        'Klassiker',
        'Belletristik'
    ],
    'Januar': [120, 200, 80, 95, 160],
    'Februar': [150, 180, 90, 110, 170],
    'März': [130, 220, 75, 100, 155]
}
df = pd.DataFrame(data)
df

,Buchtitel,Autor,Genre,Januar,Februar,März
0,Der Ruf des Kuckucks,Robert Galbraith,Krimi,120,150,130
1,Harry Potter und der Stein der Weisen,J.K. Rowling,Fantasy,200,180,220
2,Eine kurze Geschichte der Zeit,Stephen Hawking,Wissenschaft,80,90,75
3,Stolz und Vorurteil,Jane Austen,Klassiker,95,110,100
4,Die Mitternachtsbibliothek,Matt Haig,Belletristik,160,170,155

Zeigt die ersten 3 Zeilen des DataFrames an.
Überprüft die Datentypen der Spalten.

Erhaltet eine Zusammenfassung der statistischen Kennzahlen für die numerischen Spalten.

In [5]:
df.head(3)

,Buchtitel,Autor,Genre,Januar,Februar,März
0,Der Ruf des Kuckucks,Robert Galbraith,Krimi,120,150,130
1,Harry Potter und der Stein der Weisen,J.K. Rowling,Fantasy,200,180,220
2,Eine kurze Geschichte der Zeit,Stephen Hawking,Wissenschaft,80,90,75

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Buchtitel  5 non-null      object
 1   Autor      5 non-null      object
 2   Genre      5 non-null      object
 3   Januar     5 non-null      int64
 4   Februar    5 non-null      int64
 5   März       5 non-null      int64
dtypes: int64(3), object(3)
memory usage: 372.0+ bytes

In [7]:
df.describe()

           Januar     Februar        März
count    5.000000    5.000000    5.000000
mean   131.000000  140.000000  136.000000
std     49.040799   38.729833   55.834577
min     80.000000   90.000000   75.000000
25%     95.000000  110.000000  100.000000
50%    120.000000  150.000000  130.000000
75%    160.000000  170.000000  155.000000
max    200.000000  180.000000  220.000000

# 2: Datenzugriff und Filterung
Wählt nur die Spalten "Buchtitel" und "Autor" aus und zeigt sie an.
Filtert den DataFrame, um nur Bücher anzuzeigen, die im Januar mehr als 100 Einheiten verkauft haben.
Findet alle Fantasy-Bücher und zeigt ihre Titel und Verkaufszahlen für März an.

In [8]:
# Wählt nur die Spalten "Buchtitel" und "Autor" aus und zeigt sie an.
df.loc[:,["Buchtitel", "Autor"]]

                               Buchtitel             Autor
0                   Der Ruf des Kuckucks  Robert Galbraith
1  Harry Potter und der Stein der Weisen      J.K. Rowling
2         Eine kurze Geschichte der Zeit   Stephen Hawking
3                    Stolz und Vorurteil       Jane Austen
4             Die Mitternachtsbibliothek         Matt Haig

In [10]:
# Filtert den DataFrame, um nur Bücher anzuzeigen, die im Januar mehr als 100 Einheiten verkauft haben.
df.loc[df["Januar"]>100]

,Buchtitel,Autor,Genre,Januar,Februar,März
0,Der Ruf des Kuckucks,Robert Galbraith,Krimi,120,150,130
1,Harry Potter und der Stein der Weisen,J.K. Rowling,Fantasy,200,180,220
4,Die Mitternachtsbibliothek,Matt Haig,Belletristik,160,170,155

In [11]:
#Findet alle Fantasy-Bücher und zeigt ihre Titel und Verkaufszahlen für März an.
df.loc[df["Genre"]=="Fantasy",["Buchtitel", "März"]]

                               Buchtitel  März
1  Harry Potter und der Stein der Weisen   220

# 3: Neue Spalten und Berechnungen

In [12]:
# Berechnet die "Gesamt_Verkaeufe" für jedes Buch über alle drei Monate (Januar, Februar, März) und fügt diese als neue Spalte dem DataFrame hinzu.
df["Gesamt_Verkaeufe"] = df["Januar"]+df["Februar"]+df["März"]
df

,Buchtitel,Autor,Genre,Januar,Februar,März,Gesamt_Verkaeufe
0,Der Ruf des Kuckucks,Robert Galbraith,Krimi,120,150,130,400
1,Harry Potter und der Stein der Weisen,J.K. Rowling,Fantasy,200,180,220,600
2,Eine kurze Geschichte der Zeit,Stephen Hawking,Wissenschaft,80,90,75,245
3,Stolz und Vorurteil,Jane Austen,Klassiker,95,110,100,305
4,Die Mitternachtsbibliothek,Matt Haig,Belletristik,160,170,155,485

In [14]:
# Findet das Buch mit den höchsten "Gesamt_Verkaeufe".
df.loc[df["Gesamt_Verkaeufe"].idxmax()]

Buchtitel           Harry Potter und der Stein der Weisen
Autor                                        J.K. Rowling
Genre                                             Fantasy
Januar                                                200
Februar                                               180
März                                                  220
Gesamt_Verkaeufe                                      600
Name: 1, dtype: object

# 4: Sortieren und Gruppieren

In [16]:
# Sortiert den DataFrame absteigend nach den "Gesamt_Verkaeufe".
df.sort_values("Gesamt_Verkaeufe", ascending=False)

,Buchtitel,Autor,Genre,Januar,Februar,März,Gesamt_Verkaeufe
1,Harry Potter und der Stein der Weisen,J.K. Rowling,Fantasy,200,180,220,600
4,Die Mitternachtsbibliothek,Matt Haig,Belletristik,160,170,155,485
0,Der Ruf des Kuckucks,Robert Galbraith,Krimi,120,150,130,400
3,Stolz und Vorurteil,Jane Austen,Klassiker,95,110,100,305
2,Eine kurze Geschichte der Zeit,Stephen Hawking,Wissenschaft,80,90,75,245

In [19]:
# Gruppiert den DataFrame nach "Genre" und berechnet die durchschnittlichen Gesamtverkäufe pro Genre.
df.groupby(by="Genre", observed=False).agg({"Gesamt_Verkaeufe":"mean"})

              Gesamt_Verkaeufe
Genre
Belletristik             485.0
Fantasy                  600.0
Klassiker                305.0
Krimi                    400.0
Wissenschaft             245.0